/*
*********************************************************************************************************
* Filename      : task_wifi.c
* Version       : V1.00
* Programmer(s) : DC
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/
#include "stm32f4xx.h"
#include "ucos_ii.h"
#include "task_temp.h"
#include "task_start.h"

#include "stdio.h"

#include "SI7021.h"
/*
*********************************************************************************************************
*                                            LOCAL DEFINES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                       LOCAL GLOBAL VARIABLES
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                         FUNCTION PROTOTYPES
*********************************************************************************************************
*/

/***
 * 函数名称 : APP_TASK_TEMP();
 *
 * 函数描述 : WIFI任务;
 *
 * 传递值	  : 无;
 *
 * 返回值   : 无;
 *
 **/
 #include "sys_delay.h"
 #include "oled.h"
 #include "infrared.h"
 #include "ov7670.h"
 #include "ov7670test.h"
 
void APP_TASK_TEMP(void *p_arg)
{
	/* OLED模块IO初始化配置 */
	if (OV7670_Init() != 0)
	{
		printf("Ov7670 Init Failed.\r\n");
	}
	else
	{
		printf("Ov7670 Init Succeed.\r\n");
#ifdef OV7670_DBG
		OV7670_USART_Init();
#endif
	}
	Infrared_Init();
	OLED_Init();
	printf("OLED IO Init succeed.\r\n");
	
	/* WIFI模块IO初始化配置 */
    SI_IO_Init();
	printf("SI7021 IO Init succeed.\r\n");
	
	while(1)
	{
		OSTaskSuspend(APP_TASK_USER_TEMP_PRIO);
		SI7021_measure();
        
#if OS_SEM_EN > 0u 
		OSSemPost(SYNC_SEM);
#endif  
	}
}
